articles/2020-08-11-ProjectEuler2.org
#+OPTIONS: num:nil toc:t H:4
#+OPTIONS: html-preamble:nil html-postamble:nil html-scripts:t html-style:nil
#+TITLE: Project Euler 11-20
#+DESCRIPTION: Project Euler 11-20
#+KEYWORDS: Project Euler 11-20
#+CREATOR: Enrico Benini
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="../../images/favicon.ico" type="image/x-icon">
#+HTML_HEAD_EXTRA: <link rel="icon" href="../../images/favicon.ico" type="image/x-icon">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.13.0/css/all.min.css">
#+HTML_HEAD_EXTRA:  <link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet" type="text/css">
#+HTML_HEAD_EXTRA:  <link href="https://fonts.googleapis.com/css?family=Lato" rel="stylesheet" type="text/css">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/main.css">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/blog.css">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/article.css">

* Blog
  :PROPERTIES:
  :HTML_CONTAINER_CLASS: text-center navbar navbar-inverse navbar-fixed-top
  :CUSTOM_ID: navbar
  :END:
#+INCLUDE: "../Fragments/BlogNavbarFragment.html" export html

* Project Euler 11-20
  :PROPERTIES:
  :CUSTOM_ID: Article
  :END:
  *Created: <2020-08-11 Tue>*
** Abstract
   :PROPERTIES:
   :CUSTOM_ID: ArticleAbstract
   :END:

   [[https://projecteuler.net/][Project Euler]] is a collection of math based problems you can try to
   solve using a programming language, for fun.

   Follow-up, from problem 11 to 20.

** Content
   :PROPERTIES:
   :CUSTOM_ID: ArticleContent
   :END:

*** Largest Product in a Grid
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx11
    :END:

    Problem:  [[https://projecteuler.net/problem=11][Largest Product in a Grid]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=10:81"></script>

*** Highly Divisible Triangular Number
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx12
    :END:

    Problem:  [[https://projecteuler.net/problem=12][Highly Divisible Triangular Number]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=81:98"></script>

    Note that ~find~ function from ~Data.List~ is more inefficient
    then using the handmade, recursive function I used. Just try
    Something like

#+BEGIN_SRC haskell :exports code
fromJust $ find ((==500) . length . findDivisors) triangleNumbers
#+END_SRC

    and you will see it hangs, never returning
*** Large Sum
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx13
    :END:

    Problem:  [[https://projecteuler.net/problem=13][Large Sum]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=98:206"></script>

*** Largest Collatz Sequesnce
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx14
    :END:

    Problem:  [[https://projecteuler.net/problem=14][Largest Collatz Sequnece]]
    
    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=206:226"></script>
    
*** Lattice Path
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx15
    :END:

    Problem:  [[https://projecteuler.net/problem=15][Lattice Path]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=226:236"></script>

*** Power Digit Sum
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx16
    :END:

    Problem:  [[https://projecteuler.net/problem=16][Power Digit Sum]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=236:241"></script>

*** Number Letter Count
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx17
    :END:

    Problem:  [[https://projecteuler.net/problem=17][Number Letter Count]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=241:322"></script>

*** Maximum Path Sum I
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx18
    :END:

    Problem:  [[https://projecteuler.net/problem=18][Maximum Path Sum I]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=322:352"></script>

*** Counting Sundays
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx19
    :END:

    Problem:  [[https://projecteuler.net/problem=19][Counting Sundays]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=352:388"></script>

*** Factorial Digit Sum
    :PROPERTIES:
    :CUSTOM_ID: ArticleContentEx20
    :END:

    Problem:  [[https://projecteuler.net/problem=20][Factorial Digit Sum]]

    Solution:
    #+html: <script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=388:392"></script>


** Conclusions
   :PROPERTIES:
   :CUSTOM_ID: ArticleConclusions
   :END:

   learning never ends 😃

* Share Buttons
  :PROPERTIES:
  :CUSTOM_ID: ShareButtons
  :END:
  #+BEGIN_EXPORT html
  <!-- AddToAny BEGIN -->
  <hr>
  <div class="a2a_kit a2a_kit_size_32 a2a_default_style">
  <a class="a2a_dd" href="https://www.addtoany.com/share"></a>
  <a class="a2a_button_facebook"></a>
  <a class="a2a_button_twitter"></a>
  <a class="a2a_button_whatsapp"></a>
  <a class="a2a_button_telegram"></a>
  <a class="a2a_button_linkedin"></a>
  <a class="a2a_button_email"></a>
  </div>
  <script async src="https://static.addtoany.com/menu/page.js"></script>
  <!-- AddToAny END -->
  #+END_EXPORT

  #+begin_export html
  <script type="text/javascript">
  $(function() {
    $('#text-table-of-contents > ul li').first().css("display", "none");
    $('#text-table-of-contents > ul li').last().css("display", "none");
    $('#table-of-contents').addClass("visible-lg")
  });
  </script>
  #+end_export
