articles/2020-08-11-ProjectEuler2.html
<!doctype html>
<html lang="en">
<head>
<title>Project Euler 11-20</title>
<!-- 2020-08-20 Thu 10:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="benkio">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="shortcut icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.13.0/css/all.min.css">
<link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Lato" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="../css/main.css">
<link rel="stylesheet" href="../css/blog.css">
<link rel="stylesheet" href="../css/article.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#navbar">Blog</a></li>
<li><a href="#Article">Project Euler 11-20</a>
<ul class="nav">
<li><a href="#ArticleAbstract">Abstract</a></li>
<li><a href="#ArticleContent">Content</a>
<ul class="nav">
<li><a href="#ArticleContentEx11">Largest Product in a Grid</a></li>
<li><a href="#ArticleContentEx12">Highly Divisible Triangular Number</a></li>
<li><a href="#ArticleContentEx13">Large Sum</a></li>
<li><a href="#ArticleContentEx14">Largest Collatz Sequesnce</a></li>
<li><a href="#ArticleContentEx15">Lattice Path</a></li>
<li><a href="#ArticleContentEx16">Power Digit Sum</a></li>
<li><a href="#ArticleContentEx17">Number Letter Count</a></li>
<li><a href="#ArticleContentEx18">Maximum Path Sum I</a></li>
<li><a href="#ArticleContentEx19">Counting Sundays</a></li>
<li><a href="#ArticleContentEx20">Factorial Digit Sum</a></li>
</ul>
</li>
<li><a href="#ArticleConclusions">Conclusions</a></li>
</ul>
</li>
<li><a href="#ShareButtons">Share Buttons</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Project Euler 11-20</h1>

<div id="outline-container-navbar" class="outline-2 text-center navbar navbar-inverse navbar-fixed-top">
<h2 id="navbar"><a id="sec-" name="sec-"></a>Blog</h2>
<div class="outline-text-2" id="text-navbar">
<button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#collapsableNavbar">
  <span class="icon-bar"Article 6</span>
  <span class="icon-bar"></span>
  <span class="icon-bar"></span>
</button>
<a title="Home" href="../blog.html"><h1 id="navbarTitle" class="navbar-text">Blog</h1></a>
<div class="collapse navbar-collapse" id="collapsableNavbar">
  <ul class="nav navbar-nav">
    <li><a title="Home" href="../index.html"><i class="fas fa-home fa-3x" aria-hidden="true"></i></a></li>
    <li><a title="Article List" href="../articleList.html" class="navbar-text h3">Article List</a></li>
<li><a title="Book List" href="../bookList.html" class="navbar-text h3">Book List</a></li>
<li><a title="Album List" href="../albumList.html" class="navbar-text h3">Album List</a></li>
  </ul>
</div>
</div>
</div>

<div id="outline-container-Article" class="outline-2">
<h2 id="Article"><a id="sec-" name="sec-"></a>Project Euler 11-20</h2>
<div class="outline-text-2" id="text-Article">
<p>
<b>Created: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-20 Mon&gt;</span></span></b>
</p>
</div>
<div id="outline-container-ArticleAbstract" class="outline-3">
<h3 id="ArticleAbstract"><a id="sec-" name="sec-"></a>Abstract</h3>
<div class="outline-text-3" id="text-ArticleAbstract">
<p>
<a href="https://projecteuler.net/">Project Euler</a> is a collection of math based problems you can try to
solve using a programming language, for fun.
</p>

<p>
Follow-up, from problem 11 to 20.
</p>
</div>
</div>

<div id="outline-container-ArticleContent" class="outline-3">
<h3 id="ArticleContent"><a id="sec-" name="sec-"></a>Content</h3>
<div class="outline-text-3" id="text-ArticleContent">
</div>

<div id="outline-container-ArticleContentEx11" class="outline-4">
<h4 id="ArticleContentEx11"><a id="sec-" name="sec-"></a>Largest Product in a Grid</h4>
<div class="outline-text-4" id="text-ArticleContentEx11">
<p>
Problem:  <a href="https://projecteuler.net/problem=11">Largest Product in a Grid</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=10:81"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx12" class="outline-4">
<h4 id="ArticleContentEx12"><a id="sec-" name="sec-"></a>Highly Divisible Triangular Number</h4>
<div class="outline-text-4" id="text-ArticleContentEx12">
<p>
Problem:  <a href="https://projecteuler.net/problem=12">Highly Divisible Triangular Number</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=81:98"></script>

<p>
Note that <code>find</code> function from <code>Data.List</code> is more inefficient
then using the handmade, recursive function I used. Just try
Something like
</p>

<div class="org-src-container">

<pre class="src src-haskell">fromJust <span style="color: #87cefa;">$</span> find ((<span style="color: #eedd82;">==</span>500) <span style="color: #eedd82;">.</span> length <span style="color: #eedd82;">.</span> findDivisors) triangleNumbers
</pre>
</div>

<p>
and you will see it hangs, never returning
</p>
</div>
</div>
<div id="outline-container-ArticleContentEx13" class="outline-4">
<h4 id="ArticleContentEx13"><a id="sec-" name="sec-"></a>Large Sum</h4>
<div class="outline-text-4" id="text-ArticleContentEx13">
<p>
Problem:  <a href="https://projecteuler.net/problem=13">Large Sum</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=98:206"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx14" class="outline-4">
<h4 id="ArticleContentEx14"><a id="sec-" name="sec-"></a>Largest Collatz Sequesnce</h4>
<div class="outline-text-4" id="text-ArticleContentEx14">
<p>
Problem:  <a href="https://projecteuler.net/problem=14">Largest Collatz Sequnece</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=206:226"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx15" class="outline-4">
<h4 id="ArticleContentEx15"><a id="sec-" name="sec-"></a>Lattice Path</h4>
<div class="outline-text-4" id="text-ArticleContentEx15">
<p>
Problem:  <a href="https://projecteuler.net/problem=15">Lattice Path</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=226:236"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx16" class="outline-4">
<h4 id="ArticleContentEx16"><a id="sec-" name="sec-"></a>Power Digit Sum</h4>
<div class="outline-text-4" id="text-ArticleContentEx16">
<p>
Problem:  <a href="https://projecteuler.net/problem=16">Power Digit Sum</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=236:241"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx17" class="outline-4">
<h4 id="ArticleContentEx17"><a id="sec-" name="sec-"></a>Number Letter Count</h4>
<div class="outline-text-4" id="text-ArticleContentEx17">
<p>
Problem:  <a href="https://projecteuler.net/problem=17">Number Letter Count</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=241:322"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx18" class="outline-4">
<h4 id="ArticleContentEx18"><a id="sec-" name="sec-"></a>Maximum Path Sum I</h4>
<div class="outline-text-4" id="text-ArticleContentEx18">
<p>
Problem:  <a href="https://projecteuler.net/problem=18">Maximum Path Sum I</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=322:352"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx19" class="outline-4">
<h4 id="ArticleContentEx19"><a id="sec-" name="sec-"></a>Counting Sundays</h4>
<div class="outline-text-4" id="text-ArticleContentEx19">
<p>
Problem:  <a href="https://projecteuler.net/problem=19">Counting Sundays</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=352:388"></script>
</div>
</div>

<div id="outline-container-ArticleContentEx20" class="outline-4">
<h4 id="ArticleContentEx20"><a id="sec-" name="sec-"></a>Factorial Digit Sum</h4>
<div class="outline-text-4" id="text-ArticleContentEx20">
<p>
Problem:  <a href="https://projecteuler.net/problem=20">Factorial Digit Sum</a>
</p>

<p>
Solution:
</p>
<script src="https://gist-it.appspot.com/https://github.com/benkio/GeneralExercises/blob/master/ProjectEuler/projectEuler2.hs?slice=388:392"></script>
</div>
</div>
</div>


<div id="outline-container-ArticleConclusions" class="outline-3">
<h3 id="ArticleConclusions"><a id="sec-" name="sec-"></a>Conclusions</h3>
<div class="outline-text-3" id="text-ArticleConclusions">
<p>
learning never ends 😃
</p>
</div>
</div>
</div>

<div id="outline-container-ShareButtons" class="outline-2">
<h2 id="ShareButtons"><a id="sec-" name="sec-"></a>Share Buttons</h2>
<div class="outline-text-2" id="text-ShareButtons">
<!-- AddToAny BEGIN -->
<hr>
<div class="a2a_kit a2a_kit_size_32 a2a_default_style">
<a class="a2a_dd" href="https://www.addtoany.com/share"></a>
<a class="a2a_button_facebook"></a>
<a class="a2a_button_twitter"></a>
<a class="a2a_button_whatsapp"></a>
<a class="a2a_button_telegram"></a>
<a class="a2a_button_linkedin"></a>
<a class="a2a_button_email"></a>
</div>
<script async src="https://static.addtoany.com/menu/page.js"></script>
<!-- AddToAny END -->

<script type="text/javascript">
$(function() {
  $('#text-table-of-contents > ul li').first().css("display", "none");
  $('#text-table-of-contents > ul li').last().css("display", "none");
  $('#table-of-contents').addClass("visible-lg")
});
</script>
</div>
</div>
</div></div></div>
</body>
</html>
